tutorials/lagrangian/trackedReactingParcelFoam/filter/constant/pointMassSourcesProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      pointMassSourcesProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

active          true;

pointSources
(
    source1
    {
        timeStart   0.2;
        duration    0.5;
        location    (2.75 0.5 0);
        fieldData
        (
            (H2O     0.1)
        );
    }
);

// ************************************************************************* //
