tutorials/lagrangian/trackedReactingParcelFoam/filter/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5.x                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    location    "0";
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 350;

boundaryField
{
    walls
    {
        type            fixedValue;
        value           uniform 400;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 350;
    }

    outlet
    {
        type            zeroGradient;
    }

    cycLeft
    {
        type            cyclic;
    }

    cycRight
    {
        type            cyclic;
    ]

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
